### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
total_players = len(df)
total_players

780

In [4]:
summary_table = pd.DataFrame({'Total_players' : total_players }, index = [0])
summary_table

   Total_players
0            780

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
unique_items = df.nunique().sum()
unique_items

1905

In [6]:
avg_price = round(df['Price'].mean(), 1)
avg_price

3.1

In [7]:
Num_of_Purchases = num_purchases = len(df)
Num_of_Purchases

780

In [8]:
Total_Revenue = df['Price'].sum()
Total_Revenue

2379.77

In [9]:
summary_table2 = pd.DataFrame({'Number_of_Unique_Items': unique_items,
                              'Average_Price':avg_price,
                              'Number_of_Purchases': Num_of_Purchases,
                              'Total_Revenue': Total_Revenue}, index = [0])
summary_table2

   Number_of_Unique_Items  Average_Price  Number_of_Purchases  Total_Revenue
0                    1905            3.1                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [11]:
count = df['Gender'].value_counts()
count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [12]:
data = df.groupby('SN').first().groupby('Gender').count()
# data = purchase_data.groupby('Gender').count()
data

                       Purchase ID  Age  Item ID  Item Name  Price
Gender
Female                          81   81       81         81     81
Male                           484  484      484        484    484
Other / Non-Disclosed           11   11       11         11     11

In [13]:
pf = df.loc[df["Gender"]== "Male"] #dataframe with all males
pf.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [14]:
num_male = len(pf['SN'].unique())
num_male

484

In [15]:
total_players = len(df['SN'].unique())
total_players

576

In [16]:
male_pct = round((num_male/total_players) * 100 , 2)
male_pct

84.03

In [17]:
cf = df.loc[df["Gender"]== "Female"] #dataframe with female players only
cf.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [18]:
num_female = len(cf['SN'].unique())
num_female

81

In [19]:
female_pct = round((num_female/total_players) * 100 , 2)
female_pct

14.06

In [20]:
of = df.loc[df["Gender"] == "Other / Non-Disclosed"] #dataframe with players with undisclosed gender
of.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [21]:
num_other = len(of['SN'].unique())
num_other

11

In [22]:
other_pct = round((num_other/total_players) * 100 , 2)
other_pct

1.91

In [23]:
total_list = [num_male, num_female, num_other]
total_list

[484, 81, 11]

In [24]:
pct_list = [male_pct, female_pct, other_pct]
pct_list

[84.03, 14.06, 1.91]

In [25]:
#create a summary table
summary_purch = pd.DataFrame({"Total_Count" : total_list, "Percentage_of_Players" : pct_list})
summary_purch

   Total_Count  Percentage_of_Players
0          484                  84.03
1           81                  14.06
2           11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [26]:
new_df = df.groupby(['Gender'], as_index = True)
new_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [27]:
purchase_count = new_df['SN'].nunique()
purchase_count

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [28]:
avg_purch = round(new_df['Price'].mean(), 2)
avg_purch

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [29]:
total_purch = new_df['Price'].sum()
total_purch

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [30]:
avg_total_purch = round(total_purch/purchase_count , 2)
avg_total_purch

Gender
Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [31]:
purchase_analysis_summary = pd.DataFrame({"Purchase_Count" : purchase_count,
                                         "Average_Purchase_Price" : avg_purch,
                                         "Total_Purchase_Value": total_purch,
                                         "Avg_Total_Purch_per_Person": avg_total_purch })
purchase_analysis_summary.head()

,Purchase_Count,Average_Purchase_Price,Total_Purchase_Value,Avg_Total_Purch_per_Person
Gender,,,,
Female,81,3.20,361.94,4.47
Male,484,3.02,1967.64,4.07
Other / Non-Disclosed,11,3.35,50.19,4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [32]:
bins = [0,10,14,19,24,29,34,39,100]
group_names = ["0-10", "10-15", "15-20", "20-25", "25-30", "30-35", "35-40", "40+"]

In [33]:
df["age_group"] = pd.cut(df["Age"], bins, labels=group_names).head()

In [34]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age_group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-25
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-25
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-25
4,4,Iskosia90,23,Male,131,Fury,1.44,20-25

In [35]:
age_df = df.groupby("age_group")
age_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age_group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-25
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-25
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-25
4,4,Iskosia90,23,Male,131,Fury,1.44,20-25
5,5,Yalae81,22,Male,81,Dreamkiss,3.61,NaN
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18,NaN
7,7,Iskjaskst81,20,Male,162,Abyssal Shard,2.67,NaN
8,8,Undjask33,22,Male,21,Souleater,1.10,NaN
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58,NaN

In [36]:
age_df["age_group"].count()

age_group
0-10     0
10-15    0
15-20    0
20-25    4
25-30    0
30-35    0
35-40    0
40+      1
Name: age_group, dtype: int64

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [37]:
df.head(3)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age_group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-25
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-25

In [38]:
bins = [-1,10,14,19,24,29,34,39,100]
group_names = ["0-10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [39]:
df["age_group"] = pd.cut(df["Age"], bins, labels=group_names)

In [41]:
df["age_group"].isna().sum()

0

In [42]:
df["age_group"].value_counts()

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
0-10      32
10-14     19
40+       13
Name: age_group, dtype: int64

In [43]:
unique_players = df.groupby('SN').first().reset_index()
num_of_player_per_agegroup = unique_players.groupby('age_group').count()[['SN']].reset_index()
num_of_player_per_agegroup

  age_group   SN
0      0-10   24
1     10-14   15
2     15-19  107
3     20-24  258
4     25-29   77
5     30-34   52
6     35-39   31
7       40+   12

In [44]:
total_purchase = df.groupby("age_group").sum()[['Price']]
total_purchase = total_purchase.rename(columns = {"Price": "Total Purchase Value"})
total_purchase = total_purchase.reset_index()
total_purchase

  age_group  Total Purchase Value
0      0-10                108.96
1     10-14                 50.95
2     15-19                412.89
3     20-24               1114.06
4     25-29                293.00
5     30-34                214.00
6     35-39                147.67
7       40+                 38.24

In [45]:
total_price = df['Price'].sum()
print(total_price)

# avg_purch_price = total_price/total_players
# print(avg_purch_price)

2379.77

In [46]:
pcount = df.groupby("age_group").count()[['Purchase ID']]
pcount = pcount.rename(columns = {"Purchase ID": "Purchase Count"})
pcount = pcount.reset_index()
pcount

  age_group  Purchase Count
0      0-10              32
1     10-14              19
2     15-19             136
3     20-24             365
4     25-29             101
5     30-34              73
6     35-39              41
7       40+              13

In [47]:
app = df.groupby("age_group").mean()[['Price']]
app = app.rename(columns  = {"Price":"Average Purchase Price"})
app = app.reset_index()
app

  age_group  Average Purchase Price
0      0-10                3.405000
1     10-14                2.681579
2     15-19                3.035956
3     20-24                3.052219
4     25-29                2.900990
5     30-34                2.931507
6     35-39                3.601707
7       40+                2.941538

In [48]:
output = pd.merge(pcount, app, how = 'outer', on = "age_group")
output

  age_group  Purchase Count  Average Purchase Price
0      0-10              32                3.405000
1     10-14              19                2.681579
2     15-19             136                3.035956
3     20-24             365                3.052219
4     25-29             101                2.900990
5     30-34              73                2.931507
6     35-39              41                3.601707
7       40+              13                2.941538

In [49]:
output_TP = pd.merge(output, total_purchase, how = 'outer', on = 'age_group')
output_TP

  age_group  Purchase Count  Average Purchase Price  Total Purchase Value
0      0-10              32                3.405000                108.96
1     10-14              19                2.681579                 50.95
2     15-19             136                3.035956                412.89
3     20-24             365                3.052219               1114.06
4     25-29             101                2.900990                293.00
5     30-34              73                2.931507                214.00
6     35-39              41                3.601707                147.67
7       40+              13                2.941538                 38.24

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [53]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age_group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [54]:
count_user = df.groupby(['SN']).count()['Price'].rename('Purchase Count').reset_index()
#count_user
avg_pp = df.groupby(["SN"]).mean()["Price"].rename("Average Purchase Price").reset_index()
total_pp = df.groupby(["SN"]).sum()["Price"].rename("Total Purchase Value").reset_index()

In [55]:
top_spenders_df1 = pd.merge(count_user, avg_pp, how = 'outer', on = 'SN')
top_spenders_df = pd.merge(top_spenders_df1, total_pp, how = 'outer', on = 'SN').sort_values("Total Purchase Value", ascending=False)
top_spenders_df.head()

              SN  Purchase Count  Average Purchase Price  Total Purchase Value
360    Lisosia93               5                3.792000                 18.96
246  Idastidru52               4                3.862500                 15.45
106   Chamjask73               3                4.610000                 13.83
275       Iral74               4                3.405000                 13.62
281  Iskadarya95               3                4.366667                 13.10

In [60]:
#top_spenders_df["Average Purchase Price"] = top_spenders_df["Average Purchase Price"].map("${:,.2f}")
# top_spenders_df["Total Purchase Value"] = top_spenders_df["Total Purchase Value"].map("${:,.2f}".format)
#top_spenders_df

In [58]:
top_spenders_df.set_index('SN')
top_spenders_df.head()

              SN  Purchase Count  Average Purchase Price  Total Purchase Value
360    Lisosia93               5                3.792000                 18.96
246  Idastidru52               4                3.862500                 15.45
106   Chamjask73               3                4.610000                 13.83
275       Iral74               4                3.405000                 13.62
281  Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [61]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age_group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [63]:
# Extract item Data
item_data = df.loc[:,["Item ID", "Item Name", "Price"]]
item_data.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [66]:
#Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value
total_purch_val = item_data.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")
total_purch_val.head()

Item ID  Item Name
0        Splinter               5.12
1        Crucifer               9.78
2        Verdict               14.88
3        Phantomlight          14.94
4        Bloodlord's Fetish     8.50
Name: Total Purchase Value, dtype: float64

In [67]:
item_count = item_data.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
item_count.head()

Item ID  Item Name
0        Splinter              4
1        Crucifer              3
2        Verdict               6
3        Phantomlight          6
4        Bloodlord's Fetish    5
Name: Purchase Count, dtype: int64

In [75]:
item_purchase = item_data.groupby(["Item ID", "Item Name"]).mean()["Price"]
item_purchase.head()

Item ID  Item Name
0        Splinter              1.28
1        Crucifer              3.26
2        Verdict               2.48
3        Phantomlight          2.49
4        Bloodlord's Fetish    1.70
Name: Price, dtype: float64

In [79]:
popular_items = pd.DataFrame({"Purchase Count": item_count, "Item Price": item_purchase, "Total Purchase Value": total_purch_val }).sort_values('Purchase Count', ascending =False)
popular_items.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [81]:
popular_items.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16